app/Answer.php

    public static function boot()
    {
        parent::boot();
        static::created(function ($answer) {
            $answer->question->increment('answers_count');
        });

        static::deleted(function ($answer) {
            $question = $answer->question;
            $question->decrement('answers_count');
---
update `questions` set `answers_count` = `answers_count` - 1, `questions`.`updated_at` = '2019-12-18 11:35:15' where `id` = 11