app/Comment.php

    public static function boot()
    {
        parent::boot();
        static::created(function ($comment) {
            $comment->post->increment('comments_count');
        });

        static::deleted(function ($comment) {
            $post = $comment->post;
            $post->decrement('comments_count');
---
update `posts` set `comments_count` = `comments_count` - 1, `posts`.`updated_at` = '2019-12-17 10:06:36' where `id` = 17