app/Question.php

update `questions` set `best_answers_id` = 1, `questions`.`updated_at` = '2019-12-20 05:31:45' where `id` = 1
---
    public function acceptBestAnswer(Answer $answer)
    {
        $this->best_answers_id = $answer->id;
        $this->save();