app/User.php

update `votables` set `vote` = -1 where `user_id` = 1 and `votable_type` = 'App\Answer' and `votable_id` in (21)
insert into `votables` (`user_id`, `votable_id`, `votable_type`, `vote`) values (1, 25, 'App\Answer', 1)
update `answers` set `votes_count` = -2, `answers`.`updated_at` = '2019-12-17 23:20:08' where `id` = 21
---
    public function voteAnswer(Answer $answer, $vote)
    {
        $voteAnswers = $this->voteAnswers();
        if ($voteAnswers->where('votable_id', $answer->id)->exists()) {
            $voteAnswers->updateExistingPivot($answer, ['vote' => $vote]);
        }
        else {
            $voteAnswers->attach($answer, ['vote' => $vote]);
        }
        //refresh the vote relationship
        $answer->load('votes');
        //sum the negative votes
        $downVotes = (int) $answer->downVotes()->sum('vote');
        //sum the positive votes
        $upVotes = (int) $answer->upVotes()->sum('vote');
        //find the votes numbers
        $answer->votes_count = $upVotes + $downVotes;
        //save to the database and uplaod
        $answer->save();