app/Http/Controllers/AnswersController.php

select * from `users` where `users`.`id` in (1)
---
    public function store(Question $question, Request $request)
    {
        $answer = $question->answers()->create($request->validate([
            'body' => 'required'
        ]) + ['user_id' => \Auth::id()]);
        if ($request->expectsJson())
        {
            return response()->json([
                'message' => "Your answer has been submitted successfully",
                'answer' => $answer->load('user')

update `answers` set `body` = 'TEST 1 HEY upadrted', `answers`.`updated_at` = '2019-12-20 05:54:38' where `id` = 31
---
    public function update(Request $request, Question $question, Answer $answer)
    {
        $this->authorize('update', $answer);

        $answer->update($request->validate([
            'body' => 'required',
        ]));

delete from `answers` where `id` = 30
---
    public function destroy(Question $question, Answer $answer)
    {
        $this->authorize('delete', $answer);
        $answer->delete();