app/Http/Controllers/CommentsController.php

    public function update(Request $request, Post $post, Comment $comment)
    {
        $this->authorize('update', $comment);

        $comment->update($request->validate([
            'body' => 'required',
        ]));
---
update `comments` set `body` = 'Repudiandae omnis aliquid illum tenetur. Reiciendis provident magnam iusto exercitationem eos dolor ut molestiae. Et provident ipsa impedit quia autem. Voluptatibus omnis laborum nisi nesciunt eum tempora.\r\n\r\nAdipisci cupiditate nostrum culpa dolores totam ex. Dolores officia et odit harum tempore. Eveniet in id earum totam natus.\r\n\r\nOfficia quia et et sit ut. Culpa non perferendis autem consectetur est.\r\ns\r\nEt architecto consequatur rerum. Aut qui nostrum a sunt nesciunt. Voluptate ut molestiae numquam et enim alias. Cum nesciunt est et facilis voluptate.\r\n\r\nEos ducimus iusto in sint provident voluptatem. Praesentium aperiam unde id excepturi sapiente. Et tempora saepe dolore et quasi. Ipsa et velit est ex voluptas et voluptas.', `comments`.`updated_at` = '2019-12-17 17:47:47' where `id` = 4

    public function destroy(Post $post, Comment $comment)
    {
        $this->authorize('delete', $comment);
        $comment->delete();
---
delete from `comments` where `id` = 66