app/Http/Controllers/FavoritesController.php

insert into `favorites` (`created_at`, `question_id`, `updated_at`, `user_id`) values ('2019-12-18 11:34:26', 11, '2019-12-18 11:34:26', 1)
---
    public function store(Question $question)
    {
        $question->favorites()->attach(auth()->id());