app/Http/Controllers/PostsController.php

select * from `posts` order by `created_at` desc limit 5 offset 0
select * from `users` where `users`.`id` in (1, 2, 10)
select count(*) as aggregate from `posts`
---
    public function index()
    {
        //show the latest 5 posts per page
        $posts = Post::with('user')->latest()->paginate(5);

update `posts` set `views` = `views` + 1, `posts`.`updated_at` = '2019-12-17 18:35:04' where `id` = 1
---
    public function show(Post $post)
    {
        $post->increment('views');

delete from `posts` where `id` = 21
---
    public function destroy(Post $post)
    {
        if (\Gate::denies('delete-post', $post)) {
            abort(403, "Access denied");
        }

        $post->delete();