app/Http/Controllers/QuestionsController.php

select * from `questions` order by `created_at` desc limit 5 offset 0
select * from `users` where `users`.`id` in (1, 2)
select count(*) as aggregate from `questions`
---
    public function index()
    {
        //show the latest 5 questions per page
        $questions = Question::with('user')->latest()->paginate(5);

update `questions` set `views` = `views` + 1, `questions`.`updated_at` = '2019-12-16 21:33:07' where `id` = 2
---
    public function show(Question $question)
    {
        $question->increment('views');

update `questions` set `body` = 'qqe', `questions`.`updated_at` = '2019-12-17 23:19:39' where `id` = 11
---
    public function update(AskQuestionRequest $request, Question $question)
    {
        $question->update($request->only('title', 'body'));

delete from `questions` where `id` = 27
---
    public function destroy(Question $question)
    {
        $question->delete();