app/Providers/RouteServiceProvider.php

    public function boot()
    {
        Route::bind('slug', function($slug) {
            return Question::with(['answers.user', 'answers' => function ($query) {
                $query->orderBy('votes_count', 'DESC');
            }])->where('slug', $slug)->first() ?? abort(404);
        });
---
select * from `answers` where `answers`.`question_id` in (1)
select * from `users` where `users`.`id` in (1)
select * from `answers` where `answers`.`question_id` in (1) order by `votes_count` desc
select * from `users` where `users`.`id` in (1, 2, 3)