app/Providers/RouteServiceProvider.php

select * from `comments` where `comments`.`post_id` in (1)
select * from `posts` where `slug` = 'quis-et-et-non-eum-assumenda-sit-ex-fugit-in-ullam-eius-aut-modi-consectetur' limit 1
---
    public function boot()
    {
        Route::bind('slug', function($slug) {
            return Post::with('comments.user')->where('slug', $slug)->first() ?? abort(404);